adpyke.codesnap
batisteo.vscode-django
dbaeumer.vscode-eslint
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
kevinrose.vsc-python-indent
lcjuves.vscode-gjf
mechatroner.rainbow-csv
mongodb.mongodb-vscode
ms-playwright.playwright
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.vscode-speech
ms-vscode.vscode-typescript-next
njpwerner.autodocstring
pkief.material-icon-theme
rangav.vscode-thunder-client
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
wholroyd.jinja
wx-chevalier.google-java-format
xabikos.javascriptsnippets
yzhang.markdown-all-in-one

### cat extensions.txt | xargs -n 1 code --install-extension